In [2]:
import pandas as pd

pd.__version__

'1.5.3'

In [3]:
obj = pd.Series([1,"John",4.7,"Hey"])

obj

0       1
1    John
2     4.7
3     Hey
dtype: object

In [4]:
obj[0]

1

In [5]:
obj.values

array([1, 'John', 4.7, 'Hey'], dtype=object)

In [6]:
obj2 = pd.Series([1,"John",5.7,"Hey"],index= ["a","b","c","d"])

obj2

a       1
b    John
c     5.7
d     Hey
dtype: object

In [7]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [41]:
score = {"jane":45,"Bill":78,"Elon":77,"Tim":100}

names = pd.Series(score)

names

jane     45
Bill     78
Elon     77
Tim     100
dtype: int64

In [42]:
names[1]

78

In [43]:
names[0]

45

In [44]:
names["Tim"]

100

In [45]:
names[names>90]

Tim    100
dtype: int64

In [46]:
names["Tim"]=99 # update 

names

jane    45
Bill    78
Elon    77
Tim     99
dtype: int64

In [47]:
names[names>75]=90 # update more than one value
names

jane    45
Bill    90
Elon    90
Tim     90
dtype: int64

In [48]:
# check the existence of value in the dataset

"Tim" in names

True

In [49]:
"Tom" in names

False

In [50]:
# mathematical operations

names/10

jane    4.5
Bill    9.0
Elon    9.0
Tim     9.0
dtype: float64

In [51]:
names**2

jane    2025
Bill    8100
Elon    8100
Tim     8100
dtype: int64

In [52]:
names

jane    45
Bill    90
Elon    90
Tim     90
dtype: int64

In [53]:
names -=10

names

jane    35
Bill    80
Elon    80
Tim     80
dtype: int64

In [57]:
names.isnull()

jane    False
Bill    False
Elon    False
Tim     False
dtype: bool

In [58]:
games = pd.read_csv("data/vgsalesGlobale.csv")

games.head()

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37

In [60]:
games.dtypes  # check the data types

Rank              int64
Name             object
Platform         object
Year            float64
Genre            object
Publisher        object
NA_Sales        float64
EU_Sales        float64
JP_Sales        float64
Other_Sales     float64
Global_Sales    float64
dtype: object

In [61]:
games.Genre.describe()

count      16598
unique        12
top       Action
freq        3316
Name: Genre, dtype: object

In [62]:
games.Genre.value_counts()

Action          3316
Sports          2346
Misc            1739
Role-Playing    1488
Shooter         1310
Adventure       1286
Racing          1249
Platform         886
Simulation       867
Fighting         848
Strategy         681
Puzzle           582
Name: Genre, dtype: int64

In [63]:
games.Genre.value_counts(normalize=True) # tells the percentage of each value out of total

Action          0.199783
Sports          0.141342
Misc            0.104772
Role-Playing    0.089649
Shooter         0.078925
Adventure       0.077479
Racing          0.075250
Platform        0.053380
Simulation      0.052235
Fighting        0.051090
Strategy        0.041029
Puzzle          0.035064
Name: Genre, dtype: float64

In [64]:
type(games.Genre.value_counts())

pandas.core.series.Series

In [65]:
games.Genre.value_counts().head()

Action          3316
Sports          2346
Misc            1739
Role-Playing    1488
Shooter         1310
Name: Genre, dtype: int64

In [66]:
games.Genre.unique() # pick the unique value

array(['Sports', 'Platform', 'Racing', 'Role-Playing', 'Puzzle', 'Misc',
       'Shooter', 'Simulation', 'Action', 'Fighting', 'Adventure',
       'Strategy'], dtype=object)

In [67]:
games.Genre.nunique()

12

In [68]:
pd.crosstab(games.Genre,games.Year) # mutual values of two variables as a table

Year,1980.0,1981.0,1982.0,1983.0,1984.0,1985.0,1986.0,1987.0,1988.0,1989.0,...,2009.0,2010.0,2011.0,2012.0,2013.0,2014.0,2015.0,2016.0,2017.0,2020.0
Genre,,,,,,,,,,,,,,,,,,,,,
Action,1,25,18,7,1,2,6,2,2,2,...,272,226,239,266,148,186,255,119,1,0
Adventure,0,0,0,1,0,0,0,1,0,0,...,141,154,108,58,60,75,54,34,0,0
Fighting,1,0,0,0,0,1,0,2,0,0,...,53,40,50,29,20,23,21,14,0,0
Misc,4,0,1,1,1,0,0,0,0,1,...,207,201,184,38,42,41,39,18,0,0
Platform,0,3,5,5,1,4,6,2,4,3,...,29,31,37,12,37,10,14,10,0,0
Puzzle,0,2,3,1,3,4,0,0,1,5,...,79,45,43,11,3,8,6,0,0,0
Racing,0,1,2,0,3,0,1,0,1,0,...,84,57,65,30,16,27,19,20,0,0
Role-Playing,0,0,0,0,0,0,1,3,3,2,...,103,103,95,78,71,91,78,40,2,0
Shooter,2,10,5,1,3,1,4,2,1,1,...,91,81,94,48,59,47,34,32,0,0
Simulation,0,1,0,0,0,1,0,0,1,0,...,123,82,56,18,18,11,15,9,0,1
Sports,1,4,2,1,2,1,3,4,2,3,...,184,186,122,54,53,55,62,38,0,0
Strategy,0,0,0,0,0,0,0,0,0,0,...,65,53,46,15,19,8,17,10,0,0

In [69]:
games.Global_Sales.describe()

count    16598.000000
mean         0.537441
std          1.555028
min          0.010000
25%          0.060000
50%          0.170000
75%          0.470000
max         82.740000
Name: Global_Sales, dtype: float64

In [70]:
games.Global_Sales.mean()

0.5374406555006628

In [71]:
games.Global_Sales.value_counts()

0.02    1071
0.03     811
0.04     645
0.05     632
0.01     618
        ...
5.01       1
5.05       1
5.07       1
5.11       1
3.16       1
Name: Global_Sales, Length: 623, dtype: int64

In [76]:
# DataFrame 

data = {"name":["Bill","Tom","Tim","John","Alex","Vanessa","Kate"],
        "score":[90,80,85,75,95,60,65],
        "sport":["Wrestling","Football","Skiing","Swimming","Tennis","Karete","Surfing"],
        "sex":["M","M","M","M","F","F","F"]}


df =pd.DataFrame(data)

df

      name  score      sport sex
0     Bill     90  Wrestling   M
1      Tom     80   Football   M
2      Tim     85     Skiing   M
3     John     75   Swimming   M
4     Alex     95     Tennis   F
5  Vanessa     60     Karete   F
6     Kate     65    Surfing   F

In [77]:
df = pd.DataFrame(data,columns=["name","sport","sex","score"]) # exchange the columns order

df

      name      sport sex  score
0     Bill  Wrestling   M     90
1      Tom   Football   M     80
2      Tim     Skiing   M     85
3     John   Swimming   M     75
4     Alex     Tennis   F     95
5  Vanessa     Karete   F     60
6     Kate    Surfing   F     65

In [78]:
df = pd.DataFrame(data,columns=["name","sex","sport","score"])

df

      name sex      sport  score
0     Bill   M  Wrestling     90
1      Tom   M   Football     80
2      Tim   M     Skiing     85
3     John   M   Swimming     75
4     Alex   F     Tennis     95
5  Vanessa   F     Karete     60
6     Kate   F    Surfing     65

In [79]:
df.head()

   name sex      sport  score
0  Bill   M  Wrestling     90
1   Tom   M   Football     80
2   Tim   M     Skiing     85
3  John   M   Swimming     75
4  Alex   F     Tennis     95

In [80]:
df.head(2)

   name sex      sport  score
0  Bill   M  Wrestling     90
1   Tom   M   Football     80

In [81]:
df.tail() # returns bottom of the dataset

      name sex     sport  score
2      Tim   M    Skiing     85
3     John   M  Swimming     75
4     Alex   F    Tennis     95
5  Vanessa   F    Karete     60
6     Kate   F   Surfing     65

In [83]:
df.tail(3)

      name sex    sport  score
4     Alex   F   Tennis     95
5  Vanessa   F   Karete     60
6     Kate   F  Surfing     65

In [85]:
pd.DataFrame(df,columns=["name","gender","sport","score","age"]) # add age column and its value is missing

      name  gender      sport  score  age
0     Bill     NaN  Wrestling     90  NaN
1      Tom     NaN   Football     80  NaN
2      Tim     NaN     Skiing     85  NaN
3     John     NaN   Swimming     75  NaN
4     Alex     NaN     Tennis     95  NaN
5  Vanessa     NaN     Karete     60  NaN
6     Kate     NaN    Surfing     65  NaN

In [86]:
# add indices 

df = pd.DataFrame(data,columns=["name","sport","gender"],index=["one","two","three","four","five","six","seven"])

df

          name      sport gender
one       Bill  Wrestling    NaN
two        Tom   Football    NaN
three      Tim     Skiing    NaN
four      John   Swimming    NaN
five      Alex     Tennis    NaN
six    Vanessa     Karete    NaN
seven     Kate    Surfing    NaN

In [87]:
df["sport"] # show the single column

one      Wrestling
two       Football
three       Skiing
four      Swimming
five        Tennis
six         Karete
seven      Surfing
Name: sport, dtype: object

In [89]:
mycolumns =["name","sport"] # show the multiple columns

df[mycolumns]

          name      sport
one       Bill  Wrestling
two        Tom   Football
three      Tim     Skiing
four      John   Swimming
five      Alex     Tennis
six    Vanessa     Karete
seven     Kate    Surfing

In [90]:
# select column by dot(.) 

df.sport

one      Wrestling
two       Football
three       Skiing
four      Swimming
five        Tennis
six         Karete
seven      Surfing
Name: sport, dtype: object

In [91]:
df.loc[["one"]] # select specific row

     name      sport gender
one  Bill  Wrestling    NaN

In [94]:
df.loc[["one","three"]] # select more than one rows

       name      sport gender
one    Bill  Wrestling    NaN
three   Tim     Skiing    NaN

In [95]:
df["age"]=20

In [96]:
df

          name      sport gender  age
one       Bill  Wrestling    NaN   20
two        Tom   Football    NaN   20
three      Tim     Skiing    NaN   20
four      John   Swimming    NaN   20
five      Alex     Tennis    NaN   20
six    Vanessa     Karete    NaN   20
seven     Kate    Surfing    NaN   20

In [97]:
# assign values to the newly added column

values = [12,56,19,50,34,23,49]

df["age"]=values

df

          name      sport gender  age
one       Bill  Wrestling    NaN   12
two        Tom   Football    NaN   56
three      Tim     Skiing    NaN   19
four      John   Swimming    NaN   50
five      Alex     Tennis    NaN   34
six    Vanessa     Karete    NaN   23
seven     Kate    Surfing    NaN   49

In [102]:
# add the conditionally column


data = {"name":["Bill","Tom","Tim","John","Alex","Vanessa","Kate"],
        "score":[90,80,85,75,95,60,65],
        "sport":["Wrestling","Football","Skiing","Swimming","Tennis","Karete","Surfing"],
        "sex":["M","M","M","M","F","F","F"]}


df =pd.DataFrame(data)

df

      name  score      sport sex
0     Bill     90  Wrestling   M
1      Tom     80   Football   M
2      Tim     85     Skiing   M
3     John     75   Swimming   M
4     Alex     95     Tennis   F
5  Vanessa     60     Karete   F
6     Kate     65    Surfing   F

In [105]:
df["pass"]=df.score>=70

In [106]:
df

      name  score      sport sex   pass
0     Bill     90  Wrestling   M   True
1      Tom     80   Football   M   True
2      Tim     85     Skiing   M   True
3     John     75   Swimming   M   True
4     Alex     95     Tennis   F   True
5  Vanessa     60     Karete   F  False
6     Kate     65    Surfing   F  False

In [107]:
del df["pass"] # to delete the column

df

      name  score      sport sex
0     Bill     90  Wrestling   M
1      Tom     80   Football   M
2      Tim     85     Skiing   M
3     John     75   Swimming   M
4     Alex     95     Tennis   F
5  Vanessa     60     Karete   F
6     Kate     65    Surfing   F

In [108]:
scores = {"Computer Science":{"A":34,"B":78,"C":90,"D":77},
          "Mathematics":{"A":67,"B":79,"C":99,"D":75}}

df = pd.DataFrame(scores)
df

   Computer Science  Mathematics
A                34           67
B                78           79
C                90           99
D                77           75

In [109]:
# transpose the data

df.T

                   A   B   C   D
Computer Science  34  78  90  77
Mathematics       67  79  99  75

In [112]:
df.index.name = "Name"
df.columns.name = "Subject"

df

Subject  Computer Science  Mathematics
Name
A                      34           67
B                      78           79
C                      90           99
D                      77           75

In [113]:
df.values

array([[34, 67],
       [78, 79],
       [90, 99],
       [77, 75]])

In [114]:
score_index = df.index # index makes the data immutable


score_index

Index(['A', 'B', 'C', 'D'], dtype='object', name='Name')

In [115]:
score_index[1]="John"

TypeError: Index does not support mutable operations